{
  "number": "US5474148A",
  "title": "Bicycle with electric motor",
  "abstract": [
    "<p id=\"a1\">A pedal operated vehicle such as a bicycle having an electric motor assist. The assist ratio provided by the electric motor may be varied in response to a variety of vehicle conditions such as speed so as to reduce the consumption of electrical energy and to avoid over speed conditions. Various control ratio options are depicted and an embodiment is also shown wherein the operator may select the assist ratio or assist ratio curve provided.</p>"
  ],
  "description": [
    "<p id=\"d1\"><b>BACKGROUND OF THE INVENTION</b></p>",
    "<p id=\"d2\">This invention relates to a bicycle with an electric motor and more particularly to an improved electrically assisted, manually powered vehicle.</p>",
    "<p id=\"d3\">It has been proposed to extend the usefulness of pedal operated vehicles such as bicycles by incorporating an electric motor that provides a driving assist for the bicycle. Basically, this type of device operates so as to sense the force which the operator applies to the pedals and then apply an added electrical assist to the driven wheel of the vehicle. The amount of electrical assist applied is directly related to the power which the operator places on the pedals.</p>",
    "<p id=\"d4\"><b>SUMMARY OF THE INVENTION</b></p>",
    "<p id=\"d5\">This invention is adapted to be embodied in an electrically assisted, manually powered vehicle having at least one driven wheel. An operator driven driving member is coupled to the driven wheel for operator powered operation of the vehicle. Force sensing means sense the force applied by the operator to the operator driven driving member. An electric motor is provided for exerting a driving force on the vehicle and means responsive to the output of the force sensing means applies a driving force to the electric motor for electric motor assist to the driving of the Vehicle. Means are provided for selectively varying the amount of electric motor assist relative to the force sensed by the force sensing means.</p>",
    "<p id=\"d6\">It has been previously noted that the vehicle speed sensor may either sense the condition of rotation of the ring gear 47 as by the sensor 66 of FIG. 3 or the rotational speed of the front wheel 16 as sensed by the sensor 67. The ring gear sensor has an advantage in conjunction with this invention in that when the operator is not pedaling and the bicycle is coasting, then the crankshaft 28 will not rotate and also the one way clutch 39 will insure that the drive shaft 30 is not driven so that the ring gear 47 will not rotate. As a result of this, no speed will be sensed by the speed sensor and no electric motor assist will occur. This will further reduce the consumption of electrically energy.</p>",
    "<p id=\"d7\">Also the invention has been described in conjunction with a shaft drive but it can be obviously employed in conjunction with a chain driven bicycle.</p>",
    "<p id=\"d8\">It should be thus apparent from the foregoing description that the described construction provides appropriate degrees of assist ratios to suit certain purposes and thus, affords a much better control than the prior art type of constructions wherein the assist ratio is maintained constant under all conditions. Of course, the foregoing description is that of preferred embodiments of the invention and various changes and modifications may be made without departing from the spirit and scope of the invention, as defined by the appended claims.</p>"
  ],
  "claims": [
    "<p id=\"c1\">1. An electrically assisted, manually powered vehicle having at least one driving wheel, an operator driven driving member to which an operator applies a force manually, transmission means coupling said driving member to said driving wheel for operator powered driving of said vehicle, force sensing means for sensing the force applied by said operator to said operator driven driving member and outputting a force signal indicative of the actual amount of force applied by the operator in driving the vehicle, an electric motor for exerting a driving force to said vehicle, means responsive to the output force signal of said force sensing means for supplying an amount of electrical power for operating said electric motor at a ratio related to said force signal for assisting the driving of said vehicle, a vehicle condition sensing device outputting a vehicle condition signal, and means for varying the ratio of electric motor assist relative to the force sensed by said force sensing means in response to the vehicle condition signal output by said vehicle condition sensing device.</p>",
    "<p id=\"c2\">2. An electrically assisted, manually powered vehicle as set forth in claim 1 wherein the vehicle condition sensing device senses speed.</p>",
    "<p id=\"c3\">3. An electrically assisted, manually powered vehicle as set forth in claim 2 wherein the amount of electric motor assist is maintained at a constant ratio until a predetermined speed and then is varied when the speed exceeds said predetermined speed.</p>",
    "<p id=\"c4\">4. An electrically assisted, manually powered vehicle as set forth in claim 3 wherein the electric motor assist ratio is reduced as the speed increases above the predetermined speed.</p>",
    "<p id=\"c5\">5. An electrically assisted, manually powered vehicle as set forth in claim 4 wherein there is a lower predetermined speed and the amount of electric motor assist is reduced as the speed falls below that lower predetermined speed.</p>",
    "<p id=\"c6\">6. An electrically assisted, manually powered vehicle as set forth in claim 2 wherein the electric motor assist is varied from zero (0) assist ratio to a constant assist ratio as the speed of the vehicle increases from a stopped condition to a predetermined low speed.</p>",
    "<p id=\"c7\">7. An electrically assisted, manually powered vehicle as set forth in claim 6 wherein the electric motor assist ratio is reduced when the speed exceeds a predetermined high speed.</p>"
  ]
}